### 5. 인덱스 조작

In [17]:
import numpy as np
import pandas as pd

- 인덱스 설정 및 제거

In [18]:
np.random.seed(0)
df1 = pd.DataFrame(np.vstack([list('ABCDE'),
                              np.round(np.random.rand(3, 5), 2)]).T,
                   columns=["C1", "C2", "C3", "C4"])
df1

  C1    C2    C3    C4
0  A  0.55  0.65  0.79
1  B  0.72  0.44  0.53
2  C   0.6  0.89  0.57
3  D  0.54  0.96  0.93
4  E  0.42  0.38  0.07

In [19]:
df1.set_index("C1")
df1

  C1    C2    C3    C4
0  A  0.55  0.65  0.79
1  B  0.72  0.44  0.53
2  C   0.6  0.89  0.57
3  D  0.54  0.96  0.93
4  E  0.42  0.38  0.07

In [20]:
df2 = df1.set_index("C2")
df2

     C1    C3    C4
C2
0.55  A  0.65  0.79
0.72  B  0.44  0.53
0.6   C  0.89  0.57
0.54  D  0.96  0.93
0.42  E  0.38  0.07

In [21]:
df1.index, df2.index

(RangeIndex(start=0, stop=5, step=1),
 Index(['0.55', '0.72', '0.6', '0.54', '0.42'], dtype='object', name='C2'))

In [22]:
df3 = df2.set_index("C3")
df3

     C1    C4
C3
0.65  A  0.79
0.44  B  0.53
0.89  C  0.57
0.96  D  0.93
0.38  E  0.07

In [24]:
df2.reset_index()

     C2 C1    C3    C4
0  0.55  A  0.65  0.79
1  0.72  B  0.44  0.53
2   0.6  C  0.89  0.57
3  0.54  D  0.96  0.93
4  0.42  E  0.38  0.07

- 연습문제 4.5.1

In [52]:
df_score1 = pd.DataFrame(np.random.randint(60,101, size=(5,3)), columns=["국어","영어","수학"])                          
df_score1

   국어   영어  수학
0  64   63  72
1  96  100  74
2  75   80  95
3  83   75  73
4  81   65  95

In [58]:
df_score1.index[0] ='제임스','마리아','파이썬','홍길동','최자바']
df_score1.index.name = '이름'
df_score1.index

SyntaxError: unmatched ']' (3746210476.py, line 1)

- 다중 인덱스

In [59]:
np.random.seed(0)
df3 = pd.DataFrame(np.round(np.random.randn(5, 4), 2),
                   columns=[["A", "A", "B", "B"],
                            ["C1", "C2", "C1", "C2"]])
df3

      A           B
     C1    C2    C1    C2
0  1.76  0.40  0.98  2.24
1  1.87 -0.98  0.95 -0.15
2 -0.10  0.41  0.14  1.45
3  0.76  0.12  0.44  0.33
4  1.49 -0.21  0.31 -0.85

In [62]:
df3.columns.names = ["Cidx1", "Cidx2"]
df3

Cidx1     A           B
Cidx2    C1    C2    C1    C2
0      1.76  0.40  0.98  2.24
1      1.87 -0.98  0.95 -0.15
2     -0.10  0.41  0.14  1.45
3      0.76  0.12  0.44  0.33
4      1.49 -0.21  0.31 -0.85

In [67]:
df3['A','C1']

0    1.76
1    1.87
2   -0.10
3    0.76
4    1.49
Name: (A, C1), dtype: float64

In [69]:
np.random.seed(0)
df4 = pd.DataFrame(np.round(np.random.randn(6, 4), 2),
                   columns=[["A", "A", "B", "B"],
                            ["C", "D", "C", "D"]],
                   index=[["M", "M", "M", "F", "F", "F"],
                          ["id_" + str(i + 1) for i in range(3)] * 2])
df4.columns.names = ["Cidx1", "Cidx2"]
df4.index.names = ["Ridx1", "Ridx2"]
df4

Cidx1           A           B
Cidx2           C     D     C     D
Ridx1 Ridx2
M     id_1   1.76  0.40  0.98  2.24
      id_2   1.87 -0.98  0.95 -0.15
      id_3  -0.10  0.41  0.14  1.45
F     id_1   0.76  0.12  0.44  0.33
      id_2   1.49 -0.21  0.31 -0.85
      id_3  -2.55  0.65  0.86 -0.74

In [70]:
df4['A','D']['M','id_3']

0.41

In [74]:
df4.iloc[2,1], df4.loc[('M','id_3'),('A','D')]

(0.41, 0.41)